Repository: VSHAGEETHPRATHEEP06/speech-therapy-appp
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appTitle
source: Speech Therapy App
si: කථන චිකිත්සක යෙදුම
ta: பேச்சு சிகிச்சை செயலி

# loginTitle
source: Sign In
si: පිවිසෙන්න
ta: உள்நுழைய

# registerTitle
source: Create Account
si: ගිණුමක් සාදන්න
ta: கணக்கை உருவாக்கு

source: Username
si: පරිශීලක නාමය
ta: பயனர்பெயர்

source: Password
si: මුරපදය
ta: கடவுச்சொல்

source: LOGIN
si: පිවිසෙන්න
ta: உள்நுழைய

# register
source: SIGN UP
si: ලියාපදිංචි වන්න
ta: பதிவு செய்ய

source: Forgot Password?
si: මුරපදය අමතක වුණාද?
ta: கடவுச்சொல் மறந்துவிட்டதா?

# dontHaveAccount
source: Don't have an account?
si: ගිණුමක් නැද්ද?
ta: கணக்கு இல்லையா?

# alreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?
ta: ஏற்கனவே கணக்கு உள்ளதா?

# welcomeMessage
source: Welcome to Speech Therapy
si: කථන චිකිත්සාවට සාදරයෙන් පිළිගනිමු
ta: பேச்சு சிகிச்சைக்கு வரவேற்கிறோம்

# enhancedModelSubtitle
source: Enhanced Lip Reading Model Demo
si: වැඩිදියුණු කරන ලද තොල් කියවීමේ ආකෘති ආදර්ශනය
ta: மேம்படுத்தப்பட்ட உதடு வாசிப்பு மாதிரி டெமோ

source: Quick Actions
si: ඉක්මන් ක්‍රියා
ta: விரைவு செயல்கள்

source: Start Session
si: සැසිය ආරම්භ කරන්න
ta: அமர்வைத் தொடங்குங்கள்

source: Exercises
si: ව්‍යායාම
ta: பயிற்சிகள்

source: Progress
si: ප්‍රගතිය
ta: முன்னேற்றம்

source: Enhanced Model Features
si: වැඩිදියුණු කරන ලද ආකෘති විශේෂාංග
ta: மேம்படுத்தப்பட்ட மாடல் அம்சங்கள்

# modelFeature1
source: Improved Hyperparameter Tuning
si: වැඩිදියුණු කරන ලද හයිපර්පැරමීටර සීරුමාරු කිරීම
ta: மேம்படுத்தப்பட்ட ஹைப்பர்பேராமீட்டர் சீரமைப்பு

# modelFeature1Desc
source: Configurable architecture for optimal performance
si: ඉහළම කාර්යසාධනය සඳහා වින්‍යාස කළ හැකි නිර්මාණය
ta: சிறந்த செயல்திறனுக்கான கட்டமைக்கக்கூடிய கட்டமைப்பு

# modelFeature2
source: L2 Regularization
si: L2 නියාමනය
ta: L2 ஒழுங்குமுறை

# modelFeature2Desc
source: Prevents overfitting for better generalization
si: වඩා හොඳ සාමාන්‍යකරණය සඳහා අධි-ගැලපීම වළක්වයි
ta: சிறந்த பொதுமைப்படுத்தலுக்கான அதிகப்படியான பொருத்தத்தைத் தடுக்கிறது

# modelFeature3
source: Enhanced PCA Application
si: වැඩිදියුණු කරන ලද PCA යෙදුම
ta: மேம்படுத்தப்பட்ட PCA பயன்பாடு

# modelFeature3Desc
source: Standardization and optimal component selection
si: ප්‍රමිතිකරණය සහ ඉහළම සංරචක තේරීම
ta: தரப்படுத்தல் மற்றும் சிறந்த கூறு தேர்வு

# modelFeature4
source: Class Weight Balancing
si: පන්ති බර සමතුලිත කිරීම
ta: வகுப்பு எடை சமநிலைப்படுத்தல்

# modelFeature4Desc
source: Improved performance on imbalanced datasets
si: අසමතුලිත දත්ත කට්ටල මත වැඩිදියුණු කරන ලද කාර්යසාධනය
ta: சமநிலையற்ற தரவுத்தொகுப்புகளில் மேம்படுத்தப்பட்ட செயல்திறன்

# modelFeature5
source: Model Comparison Framework
si: ආකෘති සංසන්දනාත්මක රාමුව
ta: மாடல் ஒப்பீட்டு கட்டமைப்பு

# modelFeature5Desc
source: Compare multiple configurations for best results
si: හොඳම ප්‍රතිඵල සඳහා බහු වින්‍යාසයන් සංසන්දනය කරන්න
ta: சிறந்த முடிவுகளுக்கு பல கட்டமைப்புகளை ஒப்பிடவும்

# modelFeature6
source: PCA Visualization
si: PCA දෘශ්‍යකරණය
ta: PCA காட்சிப்படுத்தல்

# modelFeature6Desc
source: Visual representation of explained variance
si: පැහැදිලි කරන ලද විචල්‍යතාවයේ දෘශ්‍ය නිරූපණය
ta: விளக்கப்பட்ட வேறுபாட்டின் காட்சி பிரதிநிதித்துவம்

# modelFeature7
source: Detailed Logging & Reporting
si: සවිස්තරාත්මක ලොග් සටහන් සහ වාර්තාකරණය
ta: விரிவான பதிவு மற்றும் அறிக்கை

# modelFeature7Desc
source: Comprehensive analytics and progress tracking
si: පරිපූර්ණ විශ්ලේෂණ සහ ප්‍රගති නිරීක්ෂණය
ta: விரிவான பகுப்பாய்வு மற்றும் முன்னேற்ற கண்காணிப்பு

source: Next Session
si: ඊළඟ සැසිය
ta: அடுத்த அமர்வு

# findQuietEnvironment
source: Find a quiet environment
si: නිශ්ශබ්ද පරිසරයක් සොයන්න
ta: அமைதியான சூழலைக் கண்டறியுங்கள்

source: Good lighting
si: හොඳ ආලෝකය
ta: நல்ல ஒளி

# positionCamera
source: Position camera at eye level
si: කැමරාව ඇස් මට්ටමට තබන්න
ta: கேமராவை கண் மட்டத்தில் வைக்கவும்

source: START EXERCISE
si: ව්‍යායාමය ආරම්භ කරන්න
ta: பயிற்சியைத் தொடங்குங்கள்

source: Speech Accuracy Progress
si: කථන නිරවද්‍යතා ප්‍රගතිය
ta: பேச்சு துல்லியத்தன்மை முன்னேற்றம்

source: Overall Accuracy
si: සමස්ත නිරවද්‍යතාව
ta: ஒட்டுமொத்த துல்லியம்

source: Practice
si: පුහුණුව
ta: பயிற்சி

source: RECORD
si: වාර්තා කරන්න
ta: பதிவு

source: NEXT
si: ඊළඟ
ta: அடுத்தது

source: FINISH
si: අවසන් කරන්න
ta: முடிக்க

source: CREATE DETAILED REPORT
si: සවිස්තරාත්මක වාර්තාවක් සාදන්න
ta: விரிவான அறிக்கையை உருவாக்கவும்

source: SHARE PROGRESS REPORT
si: ප්‍රගති වාර්තාව බෙදාගන්න
ta: முன்னேற்ற அறிக்கையைப் பகிரவும்

source: Demo Credentials
si: ආදර්ශන අක්තපත්‍ර
ta: டெமோ சான்றுகள்

# demoUsername
source: Username: Thusha
si: පරිශීලක නාමය: Thusha
ta: பயனர்பெயர்: Thusha

# demoPassword
source: Password: Thusha1115
si: මුරපදය: Thusha1115
ta: கடவுச்சொல்: Thusha1115
